<template>
    <div class="all">
        <p>1.1【协议适用主体范围】</p>
        <p>本协议是您与腾讯之间关于您使用本服务所订立的协议。</p>
        <p>1.2【本服务内容】</p>
        <p>本协议视为《腾讯服务协议》（链接地址：https://www.qq.com/contract.shtml，若链接地址变更的，则以变更后的链接地址所对应的内容为准；其他链接地址变更的情形，均适用前述约定。）、《QQ号码规则》（链接地址：https://zc.qq.com/chs/agreement1_chs.html）的补充协议，是其不可分割的组成部分，与其构成统一整体。本协议与上述内容存在冲突的，以本协议为准。</p>
        <p> 本协议内容同时包括腾讯可能不断发布的关于本服务的相关协议、业务规则等内容。上述内容一经正式发布，即为本协议不可分割的组成部分，您同样应当遵守。</p>
        <p>二、【关于本服务】</p>
        <p> QQ会员、超级会员包月增值服务，指按照腾讯的指定方式支付一定包月服务费用之后，用户可以享有由腾讯或第三方提供的在腾讯产品、游戏、生活等方面特权的服务，简称为：本服务。</p>
        <p>腾讯可能会根据不同的产品及服务类型，推出不同的包月增值服务，目前，腾讯提供QQ会员、超级会员、黄钻、红钻等不同种类的包月增值服务，同时，腾讯也可能会根据用户的需求、产品及服务类型的变化等，对现有包月增值服务种类进行调整以及不断推出新的包月增值服务种类。腾讯也可能会在不同时间推出具体不同的服务内容，以不断完善、优化本服务。具体包月增值服务种类及服务内容以相关服务页面公布、实际提供的内容为准。您可以自行根据需要选择相应服务。</p>
        <p>您所享有的本服务的具体内容可能会因为级别、是否年费、开通期限、您选择的具体服务类别等因素而有不同，通常高级别、开通年费服务、开通期限较长等情况下，您将会享有更多的服务，具体以相关服务页面公布、实际提供的内容为准。</p>
        <p> 三、权利义务 3.1 【关于收费】</p>
        <p> 本服务是腾讯提供的收费服务，您须在按照本服务的收费标准支付相应费用后，方可使用本服务。此外，您也可以通过接受好友赠送等腾讯认可的其他方式享有、使用本服务。</p>
        <p>腾讯可能会根据本服务的整体规划，对本服务的收费标准、方式等进行修改和变更，前述修改、变更，腾讯将在相应服务页面进行展示。您若需要获取、使用本服务，请先提前了解清楚当时关于本服务的收费标准、方式等信息。</p>
        <p>3.2【服务开通】</p>
        <p>3.2.1您应该通过苹果应用内支付（IAP支付，in-apppurchase）,在依约支付一定费用后开通本服务。本服务开通之后，不可进行转让或退订。 您不得通过以下任何方式为自已或他人开通本服务：<br>
             （1）以营利、经营等非个人使用的目的为自己或他人开通本服务；<br>
             （2）通过任何机器人软件、蜘蛛软件、爬虫软件、刷屏软件等任何程序、软件方式为自己或他人开通本服务；<br>
             （3）通过任何不正当手段或以违反诚实信用原则的方式为自己或他人开通本服务；<br>
             （4）通过非腾讯指定的方式为自己或他人开通本服务；<br>
             （5）通过侵犯腾讯或他人合法权益的方式为自己或他人开通本服务；<br>
             （6）通过其他违反相关法律、行政法规、国家政策等的方式为自己或他人开通本服务。<br>
            3.2.2 为了让您更便捷地享受本服务，您开通的同时将默认关注QQ会员官方帐号，如您不需要使用官方帐号的各项服务，可随时取消关注。
        </p>
        <p> 3.3 【服务期限】<br>
            3.3.1本服务的服务期限以您自行选择并支付相应服务费用的期限为准，您也可以登陆腾讯充值中心或者本服务的相应页面查询。<br>
            3.3.2 本服务的服务开通最高期限会受到一定限制，具体以腾讯制定的的规则为准。
        </p>
        <p>
            3.4 【行为规范】<br>
             3.4.1【五不准】
        </p>
          
        
        
    </div>
</template>

<script>

export default {
 
  data() {
    return {
        
    }
      
  },
  methods: {
    
    
    
  },
  

}
</script>

<style lang="less" scoped="scoped">
p{
    margin: 15px 0;
}

</style>
